<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"4b43067d855d85b54ec9baa471dc0f8654edf512900aaa203169b950bc73d835","plan_job_ref":"Job Infrastructure Continuous Deployment #19 at https://github.com/sethltaylor/Bird-Sighting-Tracker/actions/runs/7965654912","plan_out_hash":"f5edff06585db7134aab6f8df482281118451b8da7cc61a3f7dd9090ad02ae0f","plan_hash":"5afd173b6c2038558d77aa62738f3be12baf573e6bd5f1c955915fe2bb467aaa","plan_text_format":"diff","version":"1.41.1"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_execution_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_execution_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ssm:GetParameter",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:ssm:us-east-1:851725613770:parameter/EBIRD_API_KEY",
            ]
        }
+       statement {
+           actions   = [
+               "dynamodb:BatchWriteItem",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:dynamodb:us-east-1:851725613770:table/RecentObservations",
            ]
        }
+       statement {
+           actions   = [
+               "s3:*",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::*",
            ]
        }
    }

  # aws_dynamodb_table.recent_observation_table will be updated in-place
!~  resource "aws_dynamodb_table" "recent_observation_table" {
        id                          = "RecentObservations"
        name                        = "RecentObservations"
        tags                        = {}
#        (10 unchanged attributes hidden)

-       attribute {
-           name = "comName" -> null
-           type = "S" -> null
        }
-       attribute {
-           name = "obsDt" -> null
-           type = "S" -> null
        }

-       global_secondary_index {
-           hash_key           = "comName" -> null
-           name               = "comName-obsDt-index" -> null
-           non_key_attributes = [] -> null
-           projection_type    = "ALL" -> null
-           range_key          = "obsDt" -> null
-           read_capacity      = 25 -> null
-           write_capacity     = 25 -> null
        }

#        (4 unchanged blocks hidden)
    }

  # aws_iam_policy.lambda_execution_policy will be updated in-place
!~  resource "aws_iam_policy" "lambda_execution_policy" {
        id          = "arn:aws:iam::851725613770:policy/lambda_execution_policy"
        name        = "lambda_execution_policy"
!~      policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "ssm:GetParameter"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:ssm:us-east-1:851725613770:parameter/EBIRD_API_KEY"
-                       Sid      = ""
                    },
-                   {
-                       Action   = "dynamodb:BatchWriteItem"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:dynamodb:us-east-1:851725613770:table/RecentObservations"
-                       Sid      = ""
                    },
-                   {
-                       Action   = "s3:*"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::*"
-                       Sid      = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
#        (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_zip will be updated in-place
!~  resource "aws_s3_object" "lambda_zip" {
!~      etag                   = "ce72ab08afc5b14453f1a9414b57663e-5" -> "5428fa084c162f6c1b6edf517f60e8e7"
        id                     = "recent_observations_lambda_deployment_package.zip"
        tags                   = {}
!~      version_id             = "********************************" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Infrastructure Continuous Deployment #19](https://github.com/sethltaylor/Bird-Sighting-Tracker/actions/runs/7965654912)